client_data = [
    ('Сергеев Сергей Сергеевич', 'Иванова Мария Ивановна', 'Химчистка ковра', 1500, 0),
    ('Васильев Василий Васильевич', 'Смирнова Елена Борисовна', 'Чистка замшевой куртки', 2000, 10),
    ('Александров Александр Александрович', 'Кузнецов Игорь Олегович', 'Химчистка штор', 1300, 5),
    ('Сергеев Сергей Сергеевич', 'Лебедева Анна Сергеевна', 'Чистка пальто', 1700, 0),
    ('Васильев Василий Васильевич', 'Ермакова Татьяна Петровна', 'Чистка кожаной куртки', 2500, 20),
    ('Александров Александр Александрович', 'Павлова Ксения Романовна', 'Химчистка дивана', 3000, 15),
    ('Васильев Василий Васильевич', 'Романова Ольга Константиновна', 'Чистка вязаного свитера', 800, 10),
    ('Александров Александр Александрович', 'Горбунова Светлана Викторовна', 'Химчистка платья', 920, 5),
    ('Васильев Василий Васильевич', 'Морозов Евгений Алексеевич', 'Чистка шелковой блузки', 2200, 10),
    ('Сергеев Сергей Сергеевич', 'Волков Дмитрий Николаевич', 'Химчистка костюма', 2500, 0),
]

